public class lesson_17_06 {
    //Java 8

    //Java 8 вышла в марте 2014 года и была самым сильным последним обновлением Java.

    //Программистам она запомнилась в первую очередь добавлением в Java лямбда-выражений и функциональных интерфейсов:
    //аннотация @FunctionalInterface.

    //Также были добавлены Stream (потоки) для коллекций, которые в сочетании с лямбда-выражениями позволяли писать код гораздо компактнее.
    //Хотя и не всегда гораздо читабельнее.
    //Появление потоков — stream — нанесло еще один удар по любителям называть нити (threads) потоками.
    //Сейчас, чтобы не путать, многие русскоязычные программисты чаще всего называют нити тредами (thread),
    //но от слова многопоточность пока не избавились.

    //Появилось целое новое API для работы с датой и временем — Date Time API.
}
