public class lesson_17_03 {
    //Java 5

    //Версия JDK 1.5 вышла в сентябре 2004 года. В ней тоже было очень много нововведений,
    //так что без очередного переименования не обошлось: вместо версий 1.5, 1.6, 1.7 решили использовать 5.0, 6.0, 7.0.
    //Поэтому полное название JDK 1.5 стало звучать как Java 2 Standard Edition 5.0
    //В это обновление вошли вещи, без которых дальнейшее развитие языка было бы невозможным.

    //Аннотации. На использовании аннотаций построена половина современных фреймворков,
    //начиная с таких громадных как Spring, Hibernate и заканчивая JUnit.

    //Дженерики. Дженерики (Generics) подняли мощь коллекций (да и не только коллекций) на новую высоту.
    //Код стал проще, компактнее и безопаснее.

    //Autoboxing/Unboxing — автоматическое преобразование между примитивными типами и их типами-обертками.
    //Это сильно упростило написание и чтение кода, а также еще больше увеличило популярность коллекций.

    //Цикл foreach сейчас составляет как минимум половину всех циклов, которые пишут программисты.
    //И, конечно, он незаменим при работе с коллекциями.

    //Enum (enumeration) — еще одно приятное нововведение. Его использование позволяет красиво упрощать многие моменты.

    //Это не все нововведения: были еще сотни новых классов, но главное в том, что это были очень правильные нововведения,
    //и они дали еще один мощный толчок популярности Java.
}
