public class lesson_17_02 {
    //Java 2

    //Первый такой скачок произошел с выходом версии JDK 1.2. Там было так много нововведений,
    //что создатели Java переименовали его в Java 2 Platform Standard Edition или сокращенно — J2SE 1.2

    //Основными нововведениями были:
    //Ключевое слово strictfp
    //Библиотека Swing для работы с графикой
    //JIT-компилятор, который ускорял работу Java-программ
    //Большой набор коллекций
    //Полная поддержка Unicode: японский, китайский и корейский языки.

    //Сегодня эти нововведения не кажутся такими уж и большими, но любой большой проект вырастает из маленького.
    //Java не была бы такой популярной сегодня, если бы 20 лет назад небольшая группа программистов не продолжала улучшать язык.
}
