public class lesson_17_17 {
    //Сравнение дат

    //Если вы хотите сравнить две даты и узнать, какая из них была раньше, для этого есть три способа

    //Способ первый — просто сравнить количество миллисекунд, которое в них хранится:
    //if (date1.getTime() < date2.getTime())

    //Способ второй — использовать метод before() объекта Date:
    //if (date1.before(date2))
    //Читается это так: если date1 перед date2, то...

    //Способ третий — использовать метод after() объекта Date:
    //if (date2.after(date1))
    //Читается это так: если date2 после date1, то...
}
