public class lesson_17_08 {
    //Java 11

    //Спустя полгода после выхода Java 9 вышла Java 10, а еще спустя полгода вышла Java 11.
    //За это время было сделано куча мелких улучшений, но скорее всего, вы запомните только два:

    //Добавлена поддержка Unicode 10. Теперь в своих Java-программах вы можете использовать emoji (эмодзи).
    //Работать с ними можно, как и с любыми другими символами — они просто часть Unicode.

    //Также было улучшено выведение типов и появилось ключевое слово var
    //Теперь можно писать:
    //var str = "Привет";

    //А компилятор преобразует это в:
    //String str = "Привет";
}
