import java.util.Date;

public class lesson_17_10 {
    //Deprecated

    //Итак, создатели Java решили ничего не удалять, а только добавлять новые классы и пакеты.
    //А как дать знать программистам, что существующему неоптимальному решению появилась достойная альтернатива?
    //Для этого придумали аннотацию @Deprecated.

    //Если какой-то метод или класс устаревал, рядом с его объявлением прописывалась эта аннотация.
    //Это значит, что программистам не рекомендуется использовать этот программный элемент.
    //Вы по-прежнему можете использовать этот класс и/или метод, но это не рекомендуется.

    //Все современные IDE, включая Intellij IDEA, умеют обрабатывать аннотацию @Deprecated.
    //Устаревшие классы и методы отображаются с перечеркнутым именем.

}