public class lesson_17_01 {
    //История версий Java

    //История Java начинается в 1991 году, когда группа программистов компании Sun решила создать язык для маленьких устройств:
    //телевизионных пультов, кофеварок, тостеров, банковских карт, и т.д.
    //Производители подобных устройств использовали очень разные процессоры для контроллеров своих изделий,
    //поэтому очень важно было не привязываться к архитектуре конкретного процессора или ОС.
    //Создатели Java решили разбить проблему на две части: их программы будут компилироваться не в машинный код конкретного контроллера,
    //а в специальный промежуточный код. Он, в свою очередь, выполняется специальной программой — виртуальной машиной.
    //Большинство программистов называют компьютер машиной.

    //За основу языка Java был взят язык C++, который очень сильно упростили и стандартизировали.
    //Если в C++ что-то можно было сделать десятью способами, то в Java оставили только один.
    //Чем-то это было похоже на переход от иероглифов к алфавиту.

    //Первую версию Java выпустили в 1996 году.
    //С тех пор Java начала свое победное шествие по всему миру, что, в свою очередь, стимулировало развитие самого языка.
    //Сейчас на Java написаны миллионы библиотек и миллиарды строк кода, а новые версии Java выходят каждые 6 месяцев:

    //Название	    Год выпуска	    Количество классов
    //JDK 1.0	    1996	        211
    //JDK 1.1	    1997	        477
    //J2SE 1.2	    1998	        1,524
    //J2SE 1.3	    2000	        1,840
    //J2SE 1.4	    2002	        2,723
    //J2SE 5.0	    2004	        3,279
    //Java SE 6	    2006	        3,793
    //Java SE 7	    2011	        4,024
    //Java SE 8	    2014	        4,240
    //Java SE 9	    2017	        6,005
    //Java SE 10	2018	        6,002
    //Java SE 11	2018	        4,411
    //Java SE 12	2019	        4,433
    //Java SE 13	2019	        4,515

    //Хоть версии Java выпускались регулярно, с точки зрения программистов, они имели разную значимость: Java развивалась скачками.
}
