public class lesson_17_05 {
    //Java 7

    //В июле 2011 года вышла Java 7. В ней должно было быть много улучшений,
    //но программисты успели добавить только небольшую часть из запланированного.
    //В частности, были добавлены такие вещи как:

    //Новая библиотека для работы с вводом и выводом данных. Она так и называется — New Input Output API и находится в пакете java.nio.

    //Автоматическое выведение типов Java-компилятором на этапе компиляции позволило программистам писать меньше кода.
    //Компилятор стал умнее, и это было только начало.

    //В switch в качестве значений стало возможно использовать строки.

    //Также был существенно улучшен процесс автоматического управления ресурсами:
    //Java-программа сама закрывает потоки данных, когда они становятся не нужны: try-with-resources.
}
