public class lesson_17_04 {
    //Java 6

    //Java 6 запомнилась большим количеством небольших улучшений и отказом от цифры 2 в названии:
    //теперь это была не Java 2 Standard Edition 6.0, а просто Java Standard Edition 6.0.

    //Вот некоторые интересные нововведения:
    //Java Compiler API позволил вызывать Java-компилятор прямо из кода.
    //Ваша программа теперь могла сгенерировать код класса в виде текста,
    //скомпилировать его, вызвав методы Java Compiler API, и тут же начать вызывать методы скомпилированного класса.
    //Есть целые направления разработки, где такая вещь очень сильно упрощала жизнь.
    //JavaScript стало возможным выполнять прямо внутри программы на Java.
    //Эта возможность появилась благодаря тому, что в JavaSE 6 был встроен JavaScript-движок Rhino.
}
